Repository: taku0/lambda_ja
Catalog: lambda_ja-level1.tmx
Source language: en_us
Languages: ja

source: Creates a new sequential or parallel {@code DoubleStream} from a {@code Spliterator.OfDouble}.
ja: {@code Spliterator.OfDouble}から新しい逐次あるいは並列{@code DoubleStream}を作成する。

source: Creates a new sequential or parallel {@code DoubleStream} from a {@code Supplier} of {@code Spliterator.OfDouble}.
ja: {@code Spliterator.OfDouble}の{@code Supplier}から新しい逐次あるいは並列{@code DoubleStream}を作成する。

source: Creates a new sequential or parallel {@code IntStream} from a {@code Spliterator.OfInt}.
ja: {@code Spliterator.OfInt}から新しい逐次あるいは並列{@code IntStream}を作成する。

source: Creates a new sequential or parallel {@code IntStream} from a {@code Supplier} of {@code Spliterator.OfInt}.
ja: {@code Spliterator.OfInt}の{@code Supplier}から新しい逐次あるいは並列{@code IntStream}を作成する。

source: Creates a new sequential or parallel {@code LongStream} from a {@code Spliterator.OfLong}.
ja: {@code Spliterator.OfLong}から新しい逐次あるいは並列{@code LongStream}を作成する。

source: Creates a new sequential or parallel {@code LongStream} from a {@code Supplier} of {@code Spliterator.OfLong}.
ja: {@code Spliterator.OfLong}の{@code Supplier}から新しい逐次あるいは並列{@code LongStream}を作成する。

source: Creates a new sequential or parallel {@code Stream} from a {@code Spliterator}.
ja: {@code Spliterator}から新しい逐次あるいは並列{@code Stream}を作成する。

source: Creates a new sequential or parallel {@code Stream} from a {@code Supplier} of {@code Spliterator}.
ja: {@code Spliterator}の{@code Supplier}から新しい逐次あるいは並列{@code Stream}を作成する。

source: Each mapped stream is {@link java.util.stream.BaseStream#close() closed} after its contents have been placed into this stream.
ja: 写像された各ストリームは、その内容がこのストリームに配置された後で{@link java.util.stream.BaseStream#close() 閉じられる}。

source: Each mapped stream is {@link java.util.stream.BaseStream#close() closed} after its contents have placed been into this stream.
ja: 写像された各ストリームは、その内容がこのストリームに配置された後で{@link java.util.stream.BaseStream#close() 閉じられる}。

source: Either the stream is unordered, or the collector has the {@link java.util.stream.Collector.Characteristics#UNORDERED} characteristic.
ja: ストリームが順序を持たない、またはコレクタが{@link java.util.stream.Collector.Characteristics#UNORDERED}特性を持つ。

source: Elements sorted by increasing absolute magnitude tend to yield more accurate results.
ja: 要素を絶対値の増加順にソートするとより正確な結果が出る傾向にある。

source: Even when a pipeline is constrained to produce a result that is consistent with the encounter order of the stream source (for example, {@code IntStream.range(0,5).parallel().map(x -> x*2).toArray()} must produce {@code [0, 2, 4, 6, 8]}), no guarantees are made as to the order in which the mapper function is applied to individual elements, or in what thread any behavioral parameter is executed for a given element.
ja: パイプラインがストリーム源に対する出現順(encounter order)に対して変わらない結果を生成するように制約されていたとしても(例えば{@code IntStream.range(0,5).parallel().map(x -> x*2).toArray()}は{@code [0, 2, 4, 6, 8]}を生成する必要がある)、各要素に対して写像関数が適用される順番に対する保障は成されないし、与えられた要素に対して挙動パラメータが実行されるスレッドの保障も無い。

source: Examples of associative operations include numeric addition, min, and max, and string concatenation.
ja: 結合的な演算の例として、数値の加算・min・max・文字列の連結などがある。

source: Examples of mutable reduction operations include: accumulating elements into a {@code Collection}; concatenating strings using a {@code StringBuilder}; computing summary information about elements such as sum, min, max, or average; computing "pivot table" summaries such as "maximum valued transaction by seller", etc.
ja: 可変的簡約処理には、要素の{@code Collection}への累積・文字列の{@code StringBuilder}を使った連結・要素に関する和や最小値や最大値や平均などの要約情報の計算・「販売者ごとの最も売り上げが大きい取引」などの「ピボットテーブル」の計算などを含む。

source: Examples.
ja: 例:

source: Except for operations identified as explicitly nondeterministic, such as {@code findAny()}, whether a stream executes sequentially or in parallel should not change the result of the computation.
ja: {@code findAny()}のように明示的に非決定的とされない限り、ストリームは逐次的に実行されても並列に実行されても計算結果を変えないはずである。

source: Except for the escape-hatch operations {@code iterator()} and {@code spliterator()}, execution begins when the terminal operation is invoked, and ends when the terminal operation completes.
ja: 逃げ道である{@code iterator()}処理および{@code spliterator()}処理を除き、パイプラインの実行は末端処理が呼び出された際に開始し、末端処理が完了した時点で終了する。

source: Finally the elements of the stream are collected and joined together.
ja: 最後にストリームの要素は収集され、共に結合される。

source: First a list is created consisting of two strings: "one"; and "two".
ja: 最初に"one"と"two"の2つの要素を持つリストが作成される。

source: For a parallel execution, this function may be called multiple times and must return a fresh value each time.
ja: 並列実行の場合、この関数は複数回呼ばれる場合があり、その度に新しい値を返す必要がある。

source: For any given element, the action may be performed at whatever time and in whatever thread the library chooses.
ja: 与えられた要素に対して、アクションはライブラリが選んだ任意の時間と任意のスレッドで実行される。

source: For any input elements {@code t1} and {@code t2}, the results {@code r1} and {@code r2} in the computation below must be equivalent:
ja: 任意の入力{@code t1}と{@code t2}に対し、下記の計算における結果{@code r1}と{@code r2}は等価である必要がある。

source: For any partially accumulated result, combining it with an empty result container must produce an equivalent result.
ja: 任意の中間結果に対して、空の結果コンテナを統合した場合等価な結果となる必要がある。

source: For collectors that do not have the {@code UNORDERED} characteristic, two accumulated results {@code a1} and {@code a2} are equivalent if {@code finisher.apply(a1).equals(finisher.apply(a2))}.
ja: {@code UNORDERED}特性を持たないコレクタに関しては、累積結果{@code a1}と{@code a2}は{@code finisher.apply(a1).equals(finisher.apply(a2))}が成り立つときに等価である。

source: For concurrent collectors, an implementation is free to (but not required to) implement reduction concurrently.
ja: 並行的なコレクタに対しては、簡約の実装は簡約を並行的に実装してもよい(しかし必ずする必要はない)。

source: For example, "find the first {@code String} with three consecutive vowels" need not examine all the input strings.
ja: 例えば、「3つの連続した母音を含む最初の{@code String}を探す」際には全ての入力文字列を調べなくてもよい

source: For example, consider the following code:
ja: 例えば、以下のコードについて考える。

source: For example, filtering a {@code Stream} obtained from a collection produces a new {@code Stream} without the filtered elements, rather than removing elements from the source collection.
ja: 例えば、コレクションを元にした{@code Stream}に対する絞り込みは、元となるコレクションから要素を削除するのではなく、絞り込んだ値からのみなる新しい{@code Stream}を生成する。

source: For example, given a stream of numbers for which we want to find the sum, we can write:
ja: 例えば、渡された数値のストリームの和を求めたい場合、次のように書ける。

source: For example, given a stream of {@code Person}, to accumulate the set of last names in each city:
ja: 例えば{@code Person}のストリームが与えられた際に、各市の名字の集合を累積するには次のようにする。

source: For example, given a stream of {@code Person}, to calculate tallest person in each city:
ja: 例えば{@code Person}のストリームが与えられた際に、各市において最も背が高い人を計算するには次のようにする。

source: For example, given a stream of {@code Person}, to calculate the longest last name of residents in each city:
ja: 例えば{@code Person}のストリームが与えられた際に、各市において最も長い名字を計算するには次のようにする。

source: For example, given the following collector that computes the sum of the salaries of a stream of employees:
ja: 例えば、従業員のストリームから給与の合計を計算する次のコレクタが与えられたとする。

source: For example, if you have a stream of {@code Person}, and you want to produce a "phone book" mapping name to address, but it is possible that two persons have the same name, you can do as follows to gracefully deals with these collisions, and produce a {@code Map} mapping names to a concatenated list of addresses:
ja: 例えば、{@code Person}のストリームがあり、名前を住所と結び付ける「電話帳」を作りたいとする。しかし別の人が同じ名前を持つこともあるため、次のように、上品にそういった衝突を処理し、名前から住所を連結したリストを結び付けた{@code Map}を生成できる。

source: For example, one cannot produce any results from sorting a stream until one has seen all elements of the stream.
ja: たとえばストリームを整列した結果はストリームの全ての要素を見るまで全く生成できない。

source: For example, one could adapt the {@link #toList()} collector to always produce an immutable list with:
ja: 例えば次のようにすると、{@link #toList()}コレクタが常に不変なリストを作るようにできる。

source: For example, suppose we have a collector that computes the sum of the salaries of a stream of employees, as follows:
ja: 例えば、次のように従業員のストリームに対して給与の和を計算するコレクタがあるとする。

source: For example, the following produces a {@code Map} mapping students to their grade point average:
ja: 例えば、次のコードは生徒を平均点に写像する{@code Map}を生成する。

source: For example, the following will accumulate strings into an {@code ArrayList}:
ja: 例えば、次のコードはArrayListに文字列を累積する。

source: For example, to collect the String representations of the elements in a stream into an {@code ArrayList}, we could write the obvious sequential for-each form:
ja: 例えば、ストリーム中の要素の文字列表現を{@code ArrayList}に集めたい場合、次のような明確な逐次的for-each形式でも書ける。

source: For example, to compute the set of last names of people in each city, where the city names are sorted:
ja: 例えば、各市における名字の整列済み集合を計算するには次のようにする。

source: For example, to compute the set of last names of people in each city:
ja: 例えば、各市における名字の集合を計算するには次のようにする。

source: For example, you could create a collector that accumulates widgets into a {@code TreeSet} with:
ja: 例えば、ウィジェットを{@code TreeSet}に累積するコレクタを次のように作成できる。

source: For example, {@code Collection} has methods {@link java.util.Collection#stream} and {@link java.util.Collection#parallelStream}, which produce sequential and parallel streams respectively; other stream-bearing methods such as {@link java.util.stream.IntStream#range(int, int)} produce sequential streams but these streams can be efficiently parallelized by invoking their {@link java.util.stream.BaseStream#parallel()} method.
ja: 例えば、{@code Collection}は{@link java.util.Collection#stream}メソッドと{@link java.util.Collection#parallelStream}メソッドを持ち、それぞれ逐次的ストリームと並列ストリームを生成する。{@link java.util.stream.IntStream#range(int, int)}などの他のストリームを生じるメソッドは逐次的ストリームを生成するが、結果に対して{@code parallel()}を呼ぶと効率的に並列化できる。

source: For example:
ja: 例:

source: For most data sources, preventing interference means ensuring that the data source is not modified at all during the execution of the stream pipeline.
ja: ほとんどの情報源に対しては、干渉を防ぐということはストリームパイプラインの実行中に情報源が全く変更されないのを保障するということとなる。

source: For non-concurrent collectors, any result returned from the result supplier, accumulator, or combiner functions must be serially thread-confined.
ja: 並行的でないコレクタに対しては、結果の供給関数・累積関数・統合関数から返された結果は、逐次的にスレッドに閉じ込められている(serially thread-confined)必要がある。

source: For ordered streams, the selection of distinct elements is stable (for duplicated elements, the element appearing first in the encounter order is preserved.) For unordered streams, no stability guarantees are made.
ja: 順序を持つストリームの場合、重複を除いた要素の選択は安定的である(重複する要素の場合、出現順で最初に表われた要素が保存される)。順序を持たないストリームの場合、安定性は保障されない。

source: For ordered streams, the sort is stable.
ja: 順序を持つストリームに対して、整列は安定的である。

source: For parallel stream pipelines, the action may be called at whatever time and in whatever thread the element is made available by the upstream operation.
ja: 並列ストリームパイプラインの場合、アクションは上流の処理から利用可能になった際に任意の時間と任意のスレッドで呼ばれる。

source: For parallel stream pipelines, the {@code combiner} function operates by merging the keys from one map into another, which can be an expensive operation.
ja: 並列ストリームに対しては、{@code combiner}関数はあるマップから別のマップに対してキーを併合するように動作する。これの処理のコストは高くなる可能性がある。

source: For parallel stream pipelines, this operation does not guarantee to respect the encounter order of the stream, as doing so would sacrifice the benefit of parallelism.
ja: 並列ストリームパイプラインの場合、この処理はストリームの出現順順序を尊重するとは限らない。そのようにしてしまうと並列処理の利点を犠牲にしてしまうためである。

source: For parallel streams, relaxing the ordering constraint can sometimes enable more efficient execution.
ja: 並列ストリームに対しては、順序の制約を緩めるとより効率的な実行が可能となる場合がある。

source: For sequential streams, the presence or absence of an encounter order does not affect performance, only determinism.
ja: 逐次ストリームに対しては、順序付けは決定性にのみ影響し、効率には影響しない。

source: For spliterators that report a characteristic of {@code IMMUTABLE} or {@code CONCURRENT}, or that are late-binding, it is likely more efficient to use {@link #doubleStream(java.util.Spliterator.OfDouble, boolean)} instead.
ja: {@code IMMUTABLE}特性や{@code CONCURRENT}特性を示すスプリッテレータや遅延束縛をするスプリッテレータは代わりに{@link #doubleStream(java.util.Spliterator.OfDouble, boolean)}を使った方がより効率的である可能性が高い。

source: For spliterators that report a characteristic of {@code IMMUTABLE} or {@code CONCURRENT}, or that are late-binding, it is likely more efficient to use {@link #intStream(java.util.Spliterator.OfInt, boolean)} instead.
ja: {@code IMMUTABLE}特性や{@code CONCURRENT}特性を示すスプリッテレータや遅延束縛をするスプリッテレータは代わりに{@link #intStream(java.util.Spliterator.OfInt, boolean)}を使った方がより効率的である可能性が高い。

source: For spliterators that report a characteristic of {@code IMMUTABLE} or {@code CONCURRENT}, or that are late-binding, it is likely more efficient to use {@link #longStream(java.util.Spliterator.OfLong, boolean)} instead.
ja: {@code IMMUTABLE}特性や{@code CONCURRENT}特性を示すスプリッテレータや遅延束縛をするスプリッテレータは代わりに{@link #longStream(java.util.Spliterator.OfLong, boolean)}を使った方がより効率的である可能性が高い。

source: For spliterators that report a characteristic of {@code IMMUTABLE} or {@code CONCURRENT}, or that are late-binding, it is likely more efficient to use {@link #stream(java.util.Spliterator, boolean)} instead.
ja: {@code IMMUTABLE}特性や{@code CONCURRENT}特性を示すスプリッテレータや遅延束縛をするスプリッテレータは代わりに{@link #stream(java.util.Spliterator, boolean)}を使った方がより効率的である可能性が高い。

source: For unordered collectors, equivalence is relaxed to allow for non-equality related to differences in order.
ja: 順序を持たないコレクタに関しては、等価性は順序の違いによる差異を許すように緩めることもある

source: For unordered streams, no stability guarantees are made.
ja: 順序を持たないストリームに対して、安定性の保障は成されない。

source: For well-behaved stream sources, the source can be modified before the terminal operation commences and those modifications will be reflected in the covered elements.
ja: 行儀が良いストリーム源の場合、末端処理を開始する前なら情報源を変更でき、それらの変更はストリームが扱う要素として反映される。

source: For {@code n > 0}, the element at position {@code n}, will be the result of applying the function {@code f} to the element at position {@code n - 1}.
ja: {@code n > 0}に対しては、位置{@code n}の要素は{@code f}を位置{@code n - 1}の要素に適用した結果である。

source: From a {@link java.util.Collection} via the {@code stream()} and {@code parallelStream()} methods;
ja: {@link java.util.Collection}から{@code stream()}メソッドおよび{@code parallelStream()}メソッドを利用して入手する。

source: From an array via {@link java.util.Arrays#stream(Object[])};
ja: {@link java.util.Collection}から{@code stream()}メソッドおよび{@code parallelStream()}メソッドを利用して入手する。

source: From static factory methods on the stream classes, such as {@link java.util.stream.Stream#of(Object[])}, {@link java.util.stream.IntStream#range(int, int)} or {@link java.util.stream.Stream#iterate(Object, UnaryOperator)};
ja: ストリームクラスの{@link java.util.stream.Stream#of(Object[])}, {@link java.util.stream.IntStream#range(int, int)}, {@link java.util.stream.Stream#iterate(Object, UnaryOperator)}といった静的なファクトリメソッドを利用して入手する。

source: Functional in nature.
ja: 本質的に関数的である。

source: Further, however the computation is split, it must produce an equivalent result.
ja: さらに、どのように計算が分割されたとしても等価な結果を生成する必要がある。

source: Further, some operations are deemed short-circuiting operations.
ja: さらに、ある種の処理は<em>短絡的</em>(short-circuiting)処理であると言われる。

source: Further, some terminal operations may ignore encounter order, such as {@code forEach()}.
ja: さらに、ある種の末端処理は出現順順序を無視する({@code forEach()}など)。

source: Further, the ordering of those effects may be surprising.
ja: さらにそれらの作用の順番は予想できないものとなる場合がある。

source: Furthermore, using side-effects here is completely unnecessary; the {@code forEach()} can simply be replaced with a reduction operation that is safer, more efficient, and more amenable to parallelization:
ja: さらに、ここでの副作用の利用は完全に不必要である。{@code forEach()}はより安全でより効率的でより並列化に向いた簡約処理に置き換えられる。

source: Generally, only streams whose source is an IO channel (such as those returned by {@link Files#lines(Path, Charset)}) will require closing.
ja: 一般的に、情報源がI/Oチャンネルであるようなストリーム({@link Files#lines(Path, Charset)}が返すストリームなど)のみ閉じる必要がある。

source: Having a short-circuiting operation in the pipeline is a necessary, but not sufficient, condition for the processing of an infinite stream to terminate normally in finite time.
ja: パイプラインが短絡的処理を含むというのは無限ストリームに対する処理が有限時間で正常に完了するための必要条件であるが十分条件ではない。

source: Here we use {@code widgets}, a {@code Collection<Widget>}, as a source for a stream, and then perform a filter-map-reduce on the stream to obtain the sum of the weights of the red widgets.
ja: ここでは{@code Collection<Widget>}である{@code widget}をストリームのデータ源(source)として使い、ストリームに対して絞り込み(filter)・写像(map)・簡約(reduce)を実行して赤いウィジェットの重さの和を計算した

source: Here, equivalence generally means according to {@link java.lang.Object#equals(Object)}.
ja: ここで、等価であるとは一般的には{@link java.lang.Object#equals(Object)}によるという意味である。

source: Here, if the mapping operation is performed in parallel, the results for the same input could vary from run to run, due to thread scheduling differences, whereas, with a stateless lambda expression the results would always be the same.
ja: ここでもしマップ処理が並列に実行されると、同じ入力に対しても、スレッドのスケジューリングの違いにより、実行するごとに異なる結果となる場合がある。一方、状態を持たないラムダ式であれば結果は常に同じとなる。

source: Here, our supplier is just the {@link java.util.ArrayList#ArrayList() ArrayList constructor}, the accumulator adds the stringified element to an {@code ArrayList}, and the combiner simply uses {@link java.util.ArrayList#addAll addAll} to copy the strings from one container into the other.
ja: ここでは供給関数(supplier)はただの{@link java.util.ArrayList#ArrayList() ArrayListのコンストラクタ}であり、累積関数は文字列化した要素を{@code ArrayList}に加えていき、統合関数は単に{@link java.util.ArrayList#addAll addAll}を使ってあるコンテナから別のコンテナに文字列をコピーする。

source: Here, the identity element is both an initial seed value for the reduction and a default result if there are no input elements.
ja: ここで、単位元(identity)は簡約の最初の種となるとなる値であり、要素が無い場合のデフォルトの結果でもある。

source: How are those stream-bearing methods implemented?
ja: これらのストリーム関係のメソッドはどのように実装されているのだろうか。

source: However, a concurrent collection also has a downside.
ja: しかし、並行コレクションには欠点もある。

source: However, if the provided stream operations do not offer the desired functionality, the {@link #iterator()} and {@link #spliterator()} operations can be used to perform a controlled traversal.
ja: ただし、用意されたストリーム演算に望む機能がない場合、走査の制御のために{@link #iterator()}演算と{@link #spliterator()}演算が利用できる。

source: However, if the source has no defined encounter order, then any permutation of the values {@code [2, 4, 6]} would be a valid result.
ja: しかし、もしデータ源に出現順順序が定められていなければ、値{@code [2, 4, 6]}の任意の順列はどれも妥当な結果となる。

source: However, most stream pipelines, such as the "sum of weight of blocks" example above, still parallelize efficiently even under ordering constraints.
ja: しかしながら、上記の「ウィジェットの重さの和」の例のようなほとんどのストリームパイプラインにおいては、順序の制約があっても効率的に並列化できる。

source: However, side-effects such as using {@code println()} for debugging purposes are usually harmless.
ja: ただし、デバッグ目的での{@code println()}の利用などは通常は無害である。

source: However, since floating-point summation is not exact, the above code is not necessarily equivalent to the summation computation done by this method.
ja: しかし、浮動小数点の和は正確でないため、上記のコードはこのメソッドによる和の計算と等価とは限らない。

source: However, since some stream operations may return their receiver rather than a new stream object, it may not be possible to detect reuse in all cases.
ja: しかし、ある種のストリーム演算は新しいストリームオブジェクトではなくレシーバを返すため、再利用を常に検知できるとは限らない。

source: However, the library is free to partition the input, perform the reduction on the partitions, and then use the combiner function to combine the partial results to achieve a parallel reduction.
ja: しかし、ライブラリは入力を分割し、部分部分に簡約を適用し、統合関数を使って部分的な結果を統合して、並列簡約を実現してもよい

source: However, there are good reasons to prefer a reduce operation over a mutative accumulation such as the above.
ja: しかし、上記のような可変な累積処理よりも簡約処理を選ぶ尤もな理由がある。

source: However, we might not be happy about the performance!
ja: しかし性能は満足いくものではないだろう。

source: Ideally, a spliterator for a stream would report a characteristic of {@code IMMUTABLE} or {@code CONCURRENT}; if not it should be late-binding.
ja: 理想的にはストリームのスプリッテレータは{@code IMMUTABLE}特性または{@code CONCURRENT}特性を示す。そうでなければ遅延束縛(late-binding)するべきである。

source: If a result is passed to the combiner or finisher function, and the same object is not returned from that function, it is never used again.
ja: もし結果が統合関数や仕上げ関数に渡され、同じオブジェクトがそれらの関数から返されなかった場合は、それを再び利用してはいけない。

source: If a source cannot directly supply a recommended spliterator, it may indirectly supply a spliterator using a {@code Supplier}, and construct a stream via the {@code Supplier}-accepting versions of {@link java.util.stream.StreamSupport#stream(Supplier, int, boolean) stream()}.
ja: もしデータ源が推奨されるスプリッテレータを直接用意できない場合は、スプリッテレータを{@code Supplier}と、{@code Supplier}を受けとる{@link java.util.stream.StreamSupport#stream(Supplier, int, boolean) stream()}を使って間接的に用意してもよい。

source: If a stream is ordered, most operations are constrained to operate on the elements in their encounter order; if the source of a stream is a {@code List} containing {@code [1, 2, 3]}, then the result of executing {@code map(x -> x*2)} must be {@code [2, 4, 6]}.
ja: もしストリームが順序付けられている場合、ほとんどの処理は要素を出現順に処理するよう制約される。もしストリームが{@code [1, 2, 3]}を含む{@code List}である場合、{@code map(x -> x*2)}を実行した結果は{@code [2, 4, 6]}である必要がある。

source: If a stream is ordered, repeated execution of identical stream pipelines on an identical source will produce an identical result; if it is not ordered, repeated execution might produce different results.
ja: もしストリームが順序付けられていれば、同じ情報源に対する同じストリームパイプラインの実行は同じ結果をもたらす。もしストリームが順序付けられていなれば、繰り返し実行はは異なる結果をもたらす場合がある。

source: If a {@code CONCURRENT} collector is not also {@code UNORDERED}, then it should only be evaluated concurrently if applied to an unordered data source.
ja: もし{@code CONCURRENT}なコレクタが{@code UNORDERED}でなければ、順序を持たないデータ源に適用された場合のみ並行に評価されるべきである。

source: If any close handler throws an exception, the first exception thrown will be relayed to the caller of {@code close()}, with any remaining exceptions added to that exception as suppressed exceptions (unless one of the remaining exceptions is the same exception as the first exception, since an exception cannot suppress itself.) May return itself.
ja: もしストリームを閉じるハンドラが例外を投げた場合、最初の例外に残りの例外が抑制された例外として追加され、{@code close}の呼び出し元に投げられる(残りの例外の1つが最初の例外と同じである場合は、例外は自分自身を抑制できないため除かれる)。このストリーム自身を返す場合がある。

source: If any recorded value is a NaN or the sum is at any point a NaN then the average will be NaN.
ja: いずれかの要素が{@code NaN}であるか、いずれかの時点での和が{@code NaN}である場合、平均値は{@code NaN}となる。

source: If any recorded value is a {@code NaN} or the sum is at any point a {@code NaN} then the average will be {@code NaN}.
ja: 登録されるいずれかの要素が{@code NaN}であるか、いずれかの時点での和が{@code NaN}である場合、平均値は{@code NaN}となる。

source: If any recorded value is a {@code NaN} or the sum is at any point a {@code NaN} then the sum will be {@code NaN}.
ja: 登録されるいずれかの要素が{@code NaN}であるか、いずれかの時点での和が{@code NaN}である場合、和は{@code NaN}となる。

source: If any stream element is a NaN or the sum is at any point a NaN then the sum will be NaN.
ja: いずれかの要素が{@code NaN}であるか、いずれかの時点での和が{@code NaN}である場合、和は{@code NaN}となる。

source: If consistency with encounter order is required, and you are experiencing poor performance or memory utilization with {@code distinct()} in parallel pipelines, switching to sequential execution with {@link #sequential()} may improve performance.
ja: もし並列パイプラインにおいて出現順との整合性が必要とされ、{@code distinct()}のメモリ使用量の性能が悪い場合、{@link #sequential()}を使って逐次実行に切り換えると性能が向上する場合がある。

source: If consistency with encounter order is required, and you are experiencing poor performance or memory utilization with {@code limit()} in parallel pipelines, switching to sequential execution with {@link #sequential()} may improve performance.
ja: もし並列パイプラインにおいて出現順との整合性が必要とされ、{@code limit()}のメモリ使用量の性能が悪い場合、{@link #sequential()}を使って逐次実行に切り換えると性能が向上する場合がある。
